<?php

namespace app\commands;

use Yii;
use yii\console\Controller;
use app\models\Currency;
use app\models\Country;
use app\models\OrderStatus;
use app\models\PaymentSystem;
use app\models\Image;
use app\models\SiteInfo;
use app\models\User;
use app\models\Manager;

class SeedController extends Controller
{
    public function actionReset()
    {
		d('reset');
        $connection = Yii::$app->db;
        $connection->createCommand("SET FOREIGN_KEY_CHECKS = 0")->execute();
        foreach ($connection->getSchema()->getTableNames() as $tableName)
        {
            if ('migration' === $tableName)
                continue;

            $connection->createCommand("TRUNCATE TABLE `$tableName`")->execute();
        }
        $connection->createCommand("SET FOREIGN_KEY_CHECKS = 1")->execute();
    }

    public function actionIndex()
    {
		d('seed');
        $info = $this->_info();
        SiteInfo::saveData($info);
        $connection = Yii::$app->db;
        $transaction = $connection->beginTransaction();
        try
        {
    		d('Currency');
            if (!Currency::find()->exists())
            {
                foreach ($this->_currencies() as $currencyData)
                {
                    $currency = new Currency([
                        'id'    => $currencyData[0],
                        'name'  => $currencyData[1],
                        'code'  => $currencyData[2],
                        'rate'  => $currencyData[3],
                    ]);
                    $currency->save();
                }
            }

            d('Country');
            if (!Country::find()->exists())
            {
                foreach ($this->_countries() as $countryData)
                {
                    $country = new Country([
                        'name_uk'   => $countryData[0],
                        'name_ru'   => $countryData[0],
                        'iso3'      => $countryData[1],
                        'iso2'      => $countryData[2],
                    ]);
                    $country->save();
                }
            }

            d('OrderStatus');
            if (!OrderStatus::find()->exists())
            {
                foreach ($this->_order_statuses() as $statusData)
                {
                    $orderStatus = new OrderStatus([
                        'name_uk'   => $statusData['uk'],
                        'name_ru'   => $statusData['ru'],
                    ]);
                    $orderStatus->save();
                }
            }

            d('PaymentSystem');
            if (!PaymentSystem::find()->exists())
            {
                foreach ($this->_payment_systems() as $paymentSystemData)
                {
                    $paymentSystem = new PaymentSystem([
                        'name_uk'   => $paymentSystemData['uk'],
                        'name_ru'   => $paymentSystemData['ru'],
                    ]);
                    $paymentSystem->save();
                }
            }

            d('User');
            $admin = new User([
                'login' => 'admin',
                'email' => 'admin@hectare.com.ua',
                'is_admin' => 1,
            ]);
            $admin->setPassword('admin');
            $admin->generateAuthKey();
            if (!$admin->save())
                _d($admin->getErrors());

            d('Manager');
            $manager = new Manager([
              'name' => 'manager',
              'phone' => '380987654321'
            ]);
            $image = new Image([
              'url' => 'https://cdn4.iconfinder.com/data/icons/rcons-user/32/boss_man-512.png'
            ]);
            $image->save();
            $manager->link('image', $image);

            $transaction->commit();
        }
        catch (\Exception $e)
        {
            $transaction->rollBack();
            throw $e;
        }
    }

    private function _order_statuses()
    {
        return [
            [
                'uk' => 'Hе підтверджений',
                'ru' => 'Hе подтвержден',
            ],
            [
                'uk' => 'Підтверджений',
                'ru' => 'Подтвержден',
            ],
            [
                'uk' => 'Скасовано',
                'ru' => 'Отменен',
            ],
            [
                'uk' => 'Повернено',
                'ru' => 'Возвращено',
            ],
            [
                'uk' => 'Відправлений',
                'ru' => 'Отправлен',
            ],
            [
                'uk' => 'Оплачено',
                'ru' => 'Оплачен',
            ],
            [
                'uk' => 'Завершено',
                'ru' => 'Завершён',
            ],
        ];
    }

    private function _payment_systems()
    {
        return [
            [
                'ru' => 'Наличными',
                'uk' => 'Готівкою',
            ],
            [
                'ru' => 'Приват24',
                'uk' => 'Приват24',
            ],
            [
                'ru' => 'Безналичный расчет',
                'uk' => 'Безготівковий розрахунок',
            ],
        ];
    }

    private function _currencies()
    {
        return [
            [3, 'Доллар США', 'USD', 25.6],
            [2, 'Гривна', 'грн', 1],
            [1, 'Euro', 'EUR', 25.6],
        ];
    }

    private function _info()
    {
        return [
            'about_us_image' => 'http://hectar.wbd.com.ua/templates/gektar/images/logo.png',
            'about_us_text_uk' => "<p class=\"MsoNormal\" style=\"margin-bottom: .0001pt; text-align: justify; text-indent: 35.45pt; line-height: 150%;\"><span style=\"font-size: 14.0pt; line-height: 150%; font-family: 'Times New Roman','serif'; mso-fareast-font-family: 'Times New Roman'; background: #FDFDFD; mso-fareast-language: RU;\">На сьогоднішній день \"Корпорація Гектар\" є молодою компанією, яка успішно працює на аграрному ринку та зарекомендувала себе як надійний партнер в області агробізнесу.</span><span style=\"color: #666666; font-family: 'PT Sans Narrow', sans-serif; font-size: 14px; text-align: left; background-color: #eae8e4;\"><br></span></p><p class=\"MsoNormal\" style=\"margin-bottom: .0001pt; text-align: justify; text-indent: 35.45pt; line-height: 150%;\"><span style=\"font-size: 14.0pt; line-height: 150%; font-family: 'Times New Roman','serif'; mso-fareast-font-family: 'Times New Roman'; background: #FDFDFD; mso-fareast-language: RU;\">Основні сфери діяльності \"Корпорації Гектар\" є : </span></p><p class=\"MsoNormal\" style=\"margin-bottom: .0001pt; text-align: justify; text-indent: 35.45pt; line-height: 150%;\"><span style=\"font-size: 14.0pt; line-height: 150%; font-family: 'Times New Roman','serif'; mso-fareast-font-family: 'Times New Roman'; background: #FDFDFD; mso-fareast-language: RU;\">&nbsp;- Продаж засобів захисту рослин </span></p><p class=\"MsoNormal\" style=\"margin-bottom: .0001pt; text-align: justify; text-indent: 35.45pt; line-height: 150%;\"><span style=\"font-size: 14.0pt; line-height: 150%; font-family: 'Times New Roman','serif'; mso-fareast-font-family: 'Times New Roman'; background: #FDFDFD; mso-fareast-language: RU;\">&nbsp;- Посівного матеріалу </span></p><p class=\"MsoNormal\" style=\"margin-bottom: .0001pt; text-align: justify; text-indent: 35.45pt; line-height: 150%;\"><span style=\"font-size: 14.0pt; line-height: 150%; font-family: 'Times New Roman','serif'; mso-fareast-font-family: 'Times New Roman'; background: #FDFDFD; mso-fareast-language: RU;\">&nbsp;- Мінеральних добрив &nbsp;</span></p><p class=\"MsoNormal\" style=\"margin-bottom: .0001pt; text-align: justify; text-indent: 35.45pt; line-height: 150%;\"><span style=\"font-size: 14.0pt; line-height: 150%; font-family: 'Times New Roman','serif'; mso-fareast-font-family: 'Times New Roman'; background: #FDFDFD; mso-fareast-language: RU;\">Завдяки інноваційним підходам і постійній роботі над ефективністю, сервісом і якістю, ми визначаємо бажання клієнтів.</span></p><p class=\"MsoNormal\" style=\"margin-bottom: .0001pt; text-align: justify; text-indent: 35.45pt; line-height: 150%;\"><span style=\"font-size: 14.0pt; line-height: 150%; font-family: 'Times New Roman','serif'; mso-fareast-font-family: 'Times New Roman'; mso-fareast-language: RU;\">Молоді фахівці та досвідчені агрономи не просто працюють в області агрономії, а й розвивають сільськогосподарський ринок, розробляючи комплексні рішення, які допомагають вирішувати питання клієнтів. Ми пропонуємо вам великий асортиментний ряд продукції, який постійно поповнюється.</span></p><p class=\"MsoNormal\" style=\"margin-bottom: .0001pt; text-align: justify; text-indent: 35.45pt; line-height: 150%;\"><span style=\"font-size: 14.0pt; line-height: 150%; font-family: 'Times New Roman','serif'; mso-fareast-font-family: 'Times New Roman'; mso-fareast-language: RU;\"> Набираючи оберти, компанія збільшує свої обсяги продажів і розширює свій асортимент. Вже сьогодні ви можете вибрати продукцію таких виробників:</span></p><p class=\"MsoNormal\" style=\"margin-bottom: .0001pt; text-align: justify; text-indent: 35.45pt; line-height: 150%;\"><span style=\"font-size: 14pt; line-height: 150%; font-family: 'Times New Roman', serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\">Ви можете придбати такі засоби захисту рослин на нашому сайті: Arysta, Agro, Basf, Bayer, Cherminova, Chemtura, Dupon, Summit- Syngenta, Monsanto, Makhteshim, Nufarm, Август, Нертус, Щолково-Агрохім, Укравіт, АльфаХімГруп.</span></p><p class=\"MsoNormal\" style=\"margin-bottom: .0001pt; text-align: justify; text-indent: 35.45pt; line-height: 150%;\"><span style=\"font-size: 14pt; line-height: 150%; font-family: 'Times New Roman', serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\">Також можете продати або купити насіння оптом в Україні: Агроспецпроект, Піонер, Сингента, Нертус, Лімагрейн</span></p><p class=\"MsoNormal\" style=\"margin-bottom: .0001pt; text-align: justify; text-indent: 35.45pt; line-height: 150%;\"><span style=\"font-size: 14pt; line-height: 150%; font-family: 'Times New Roman', serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\">Є можливість купити такі мінеральні добрива в Україні: Долина, Терра Тарса, Авангард, Яра, Лист-Форте.</span></p><p class=\"MsoNormal\" style=\"margin-bottom: .0001pt; text-align: justify; text-indent: 35.45pt; line-height: 150%;\"><span style=\"font-size: 14pt; line-height: 150%; font-family: 'Times New Roman', serif; background-image: initial; background-attachment: initial; background-size: initial; background-origin: initial; background-clip: initial; background-position: initial; background-repeat: initial;\">Наш інтернет-магазин постійно поповнюється новими товарами. Якщо ви не знайшли те, що вам потрібно, залиште заявку на необхідний Вам товар у нас на сайті. Наш менеджер зв'яжеться з вами і допоможе у вирішенні цієї проблеми.</span></p><p class=\"MsoNormal\" style=\"margin-bottom: 0.0001pt; text-indent: 35.45pt; line-height: 150%; text-align: center; background: #fdfdfd;\"><b><span style=\"font-size: 14.0pt; line-height: 150%; font-family: 'Times New Roman','serif'; mso-fareast-font-family: 'Times New Roman'; background: white; mso-fareast-language: RU;\">Наш успіх</span></b><span style=\"font-size: 14.0pt; line-height: 150%; font-family: 'Times New Roman','serif'; mso-fareast-font-family: 'Times New Roman'; background: white; mso-fareast-language: RU;\">&nbsp;<strong>повністю&nbsp;</strong><b>залежить</b>&nbsp;<strong>від</strong>&nbsp;<b>успіху наших клієнтів</b></span></p><p class=\"MsoNormal\" style=\"margin-bottom: .0001pt; text-align: justify; text-indent: 35.45pt; line-height: 150%; background: #FDFDFD;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</p>",
            'about_us_title_uk' => 'Наш успіх - успіх нашіх клієнтів',
            'about_us_text_front_uk' => "<p>ПРО КОМПАНІЮ</p>\r\n\r\n<p style=\"text-align:justify\">На сьогодні &quot;Корпорація Гектар&quot; є молодою компанією . Завдяки інноваційним підходам і постійній роботі над ефективністю, сервісом та якістю ,ми &nbsp;передбачаємо бажання клієнтів .</p>\r\n\r\n<p style=\"text-align:justify\">Молоді спеціалісти та досвідчені агрономи не просто працюють в області агрономії, але й розвивають сільськогосподарський ринок, розробляючи комплексні рішення, які допомагають вирішувати питання клієнтів .</p>\r\n\r\n<p style=\"text-align:justify\">Набираючи оберти компанія збільшує свої об*єми продажів та розширює свій асортиментний ряд. Вже сьогодні ми пропонуємо &nbsp;продукцію таких виробників:</p>\r\n\r\n<p style=\"text-align:justify\"><strong><em>Засоби захисту рослин:</em></strong>&nbsp;Summit-Agro, Syngenta, Monsanto, Basf, Dupon, Bayer, Cherminova, Chemtura, Makhteshim, Nufarm, Arysta, Август, Нертус, Щьолково-Агрохім, Укравіт, АльфаХімГруп,</p>\r\n\r\n<p style=\"text-align:justify\"><strong><em>Насіння:</em></strong>&nbsp;Агроспецпроект, Піонер, Сингента, Нертус, Лімагрейн</p>\r\n\r\n<p style=\"text-align:justify\"><strong><em>Добрива:&nbsp;</em></strong>Долина, Терра Тарса, Авангард, Яра, Лист-Форте.</p>\r\n\r\n<p style=\"text-align:center\">&nbsp;</p>\r\n\r\n<p style=\"text-align:center\"><strong>Наш успіх</strong>&nbsp;повністю&nbsp;<strong>залежить</strong>&nbsp;від&nbsp;<strong>успіху наших клієнтів</strong></p>\r\n",
            "about_us_text_front_ru" => "<p>О КОМПАНИИ</p>\r\n\r\n<p style=\"text-align:justify\">На сегодняшний день &quot;Корпорация Гектар&quot; является молодой компанией.&nbsp;&nbsp;Благодаря инновационным подходам и постоянной работе над эффективностью, сервисом и качеством, мы&nbsp;определяем&nbsp;желания клиентов.</p>\r\n\r\n<p style=\"text-align:justify\">Молодые специалисты и опытные агрономы не просто работают в области агрономии, но и развивают сельскохозяйственный рынок, разрабатывая комплексные решения, которые помогают решать вопросы клиентов.</p>\r\n\r\n<p style=\"text-align:justify\">Набирая обороты компания увеличивает свои объемы продаж и расширяет свой ассортиментный ряд. Уже сегодня мы предлагаем продукцию таких производителей:</p>\r\n\r\n<p style=\"text-align:left\"><strong><em>Средства защиты растений:</em></strong>&nbsp;Summit-Agro, Syngenta, Monsanto, Basf, Dupon, Bayer, Cherminova, Chemtura, Makhteshim, Nufarm, Arysta, Август, Нертус, Щёлково-Агрохим, Укравит, АльфаХимГруп,</p>\r\n\r\n<p style=\"text-align:left\"><strong><em>Семена:</em></strong>&nbsp;Агроспецпроект, Пионер, Сингента, Нертус, Лимагрейн</p>\r\n\r\n<p style=\"text-align:left\"><strong><em>Удобрения</em></strong>:&nbsp;Долина, Терра Тарса, Авангард, Яра, Письмо-Форте.</p>\r\n\r\n<p style=\"text-align:left\">&nbsp;</p>\r\n\r\n<p style=\"text-align:center\"><strong>Наш успех полностью зависит от успеха наших клиентов!</strong></p>\r\n",
            "partners_text_uk" => "<p style=\"margin-left:6.6pt\"><strong>&laquo;Укравіт&raquo; - аграрна компанія</strong>, один з лідерів ринку засобів захисту рослин. Основними напрямками діяльності компанії є виробництво та продаж пестицидів, добрив з мікроелементами, засобів для знищення гризунів та побутових комах. Виробничі можливості корпорації направленні на забезпечення попиту у промисловому секторі та у сегменті приватних господарств.&nbsp;Сьогодні ми пропонуємо інноваційні та бюджетні рішення для сільськогосподарських виробників усіх ґрунтово-кліматичних зон України з використання високоякісних хімічних засобів захисту рослин. &laquo;Укравіт&raquo; допомагає оптимізувати витрати виробника на захист посівів та досягти максимальної рентабельності виробництва як у багатогалузевих господарствах, так і в приватному секторі. З метою зменшення факторів небезпеки і захисту населення від зооантропонозних інфекцій, створення безпечних умов господарювання та проживання населення України, мінімізації економічних збитків від шкідників у народному господарстві, компанія здійснює оптовий та роздрібний продаж препаратів для дезінсекції та дератизації. &nbsp;Продукція&nbsp;<strong>ТМ &laquo;Укравіт&raquo;</strong>&nbsp;відрізняється своєю &laquo;класичною&raquo; оригінальністю і уже понад 10 років задовольняє смаки всіх без винятку сільськогосподарських виробників. Препарати компанії забезпечують 100% захисту сільськогосподарських культур від комплексу шкідливих видів комах, кліщів, гризунів, збудників хвороб рослин (грибів, бактерій, вірусів, мікоплазм), а також бур&rsquo;янів.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>&laquo;Сингента&raquo;</strong>&mdash; це одна з провідних компаній світу, в якій працює більше 27 000 фахівців у понад 90 країнах світу задля досягнення однієї мети: розкрити потенціал рослин. Завдяки передовим науковим знанням, глобальним дослідженням та зобов&rsquo;язанням перед своїми клієнтами, компанія допомагає збільшувати врожайність сільськогосподарських культур, захищати навколишнє середовище та покращувати здоров&rsquo;я і якість життя.</p>\r\n\r\n<p style=\"margin-left:6.6pt\">Компанія&nbsp;<strong>&quot;Нертус&quot;</strong>&nbsp;&nbsp;заснована в 2002 році та вже 10 років плідно працює на агрохімічному ринку України.Асортимент фірмових препаратів НЕРТУС&reg; складається з близько 50 зареєстрованих пестицидів і мікродобрив, що повністю задовольняють потребам аграріїв при вирощуванні і зберіганні зернових культур, кукурудзи, соняшнику, рапсу, сої, цукрового буряку, плодових культур і виноградників. Всі засоби захисту рослин вироблені за європейськими стандартами якості та характеризуються високим рівнем екологічної і токсикологічної безпеки.</p>\r\n\r\n<p style=\"margin-left:6.6pt\">&nbsp;використовує наукові досягнення з метою створення продуктів, які допомагають людям вести здоровий спосіб життя, поліпшити його якість та зробити життя людей у всьому світі більш безпечним. Компанія Дюпон, котра заснована в США у 1802 році, є однією з найбільших у світі наукових та індустріальних транснаціональних корпорацій. Вона займає провідне положення у виробництві матеріалів з високими експлуатаційними характеристиками, хімікатів спеціального призначення та інших наукомістких напрямках.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>Bayer</strong>&nbsp;&ndash; міжнародний концерн зі спеціалізацією в області охорони здоров&#39;я, сільського господарства та високотехнологічних матеріалів. Як інноваційна компанія, Bayer задає тенденції розвитку наукомістких областей. Продукти і послуги компанії спрямовані на благо людей і покращення якості життя. Комерційна діяльність групи побудована на основі впровадження інновацій, економічного росту і високої прибутковості.&nbsp;Bayer дотримується принципів стійкого розвитку і виступає в якості соціально та етично відповідальної компанії. У 2012 фінансовому році чисельність співробітників концерну склала 110 500 людей, обсяг продажів &ndash; 39,8 млрд євро. Капітальні витрати склали 2 млрд євро, витрати на дослідження і розробки &ndash; 3 млрд євро.</p>\r\n\r\n<p style=\"margin-left:6.6pt\">Представництво&nbsp;<strong>BASF SE</strong>&nbsp;в Україні було відкрите в 1992 році в Києві й стало однією з перших місій великих західних концернів в нашій країні. На поточний момент наші регіональні представники працюють у всіх регіонах країни. Відділ захисту рослин обслуговує також клієнтів у Молдові та на Кавказі. Бізнес BASF в Україні виходить за межаі країни. Пластики, дисперсії та пігменти поставляються на ринок Республіки Білорусь.З 2007 року вся діяльність BASF SE в Україні ведеться через БАСФ ТОВ (Товариство з Обмеженою Відповідальністю). Кількість співробітників, працюючих в Україні на теперішній час, складає 120 чоловік.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>Компанія ТОВ &laquo;САММІТ-АГРО ЮКРЕЙН&raquo;</strong>&nbsp;була заснована в 1999 році японською корпорацією СУМІТОМОКОРПОРЕЙШН.&nbsp;Історія групи СУМІТОМО сягає своїм корінням початку XVII століття, коли Масатомо Сумітомо та Ріемон Сога об&rsquo;єднались у спільній справі &ndash; видобутку та плавці міді. Пізніше було освоєно цілий ряд інших областей діяльності, включаючи фінанси, страхування, чавунну та сталеплавильну промисловість та нерухомість. На сьогодні група Сумітомо є однією з найкрупніших комплексних груп Японії. &nbsp;Компанія СУМІТОМО КОРПОРЕЙШН була заснована в 1919р. і на сьогодні входить у п&rsquo;ятірку найкрупніших транснаціональних корпорацій світу (корпорація представлена у 67 країнах світу та має більше 72 000 співробітників). Основні напрямки бізнесу корпорації: металургія, транспорт та будівництво, інфраструктура та комунікації, енергетика та хімія, споживчі товари тощо. Агрохімічний напрямок бізнесу корпорації активно розвивається починаючи з 1962р.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>&quot;Дюпон Піонер&quot;</strong>&nbsp;є світовим лідером у розробці та наданні сучасної генетики рослин і пропонує насіння високої якості фермерам у більш ніж 90 країнах світу.&nbsp;Компанія &quot;Піонер&quot; надає агрономічну підтримку та супровід з метою підвищення продуктивності і прибутковості аграріїв, а також прагне розвивати системи стійкого ведення сільського господарства у всьому світі.&nbsp;Зростаюче населення, зміни в економіці та обмеженість орних земель є найбільшими факторами, що спонукають &quot;Піонер&quot; активно використовувати досягнення науки у рослинництві для збільшення ефективності віддачі з кожного гектару землі.</p>\r\n\r\n<p style=\"margin-left:6.6pt\">Міжнародна компанія<strong>&nbsp;ТОВ &quot;ТерраТарса Україна&quot;</strong>&nbsp;була cтворена восени 2011 року в результаті злиття компанії Doktor Tarsa (Туреччина) і групи компаній Терра. Основним видом діяльності компанії є постачання комплексних технологічних рішень для вирощування овочів у закритому та відкритому ґрунті, а також виробництво спеціальних мікродобрив для позакореневого підживлення польових культур.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>Компанія Агроспецпроект</strong>&nbsp;була заснована в 1996 році. За 12 років існування, здолавши шлях від виконання замовлень по переробці овочів для інших підприємств, компанія зайняла провідні позиції серед виробників консервів бобової групи та цукрової кукурудзи на українському ринку. Сьогодні підприємство представляє продукцію під власними торговими марками та продовжує виробництво продукції для інших компаній та приватних торгових марок.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>Компанія Yara</strong>&nbsp;бере свій початок з норвезької промислової фірми Norsk Hydro (Норск Гідро), яка була заснована в 1905 році. А саме, коли промисловці Сем Ейде, Крістіан Біркеланд і Маркус Валленберг звернулись до найбільшого гідроресурсу Норвегії з метою виробництва перших продуктів компанії: мінерального добрива, яке привертає увагу в усьому світі, оскільки давало змогу фермерам підвищувати врожайність їх культур.&nbsp;Десятиліття потому, після того, як Norsk Hydro розширила спектр своєї діяльності від добрив до нафти та металів, підрозділ, присвячений сільськогосподарській та побічній продукції, був виділений як окремий. Yara International ASA дебютувала на фондовій біржі в Осло в 2004 році, але багато чого сталося за минулі роки та історія компанії триває...</p>\r\n\r\n<p style=\"margin-left:6.6pt\">&nbsp;</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>ADAMA Agricultural Solutions Ltd. (попередня назва &ndash;MakhteshimAganIndustriesLtd.)</strong>&nbsp;- світовий лідер з виробництва та постачання брендових постпатентних засобів захисту рослин та інших продуктів хімічної промисловості.Компанія надає прості рішення для усієї низки сільськогосподарських процесів за допомогою унікальних продуктів та комбінацій діючих речовин.&nbsp;ADAMA Agricultural Solutions Ltd. - міжнародна компанія з глибокими історичними витоками, наступник всесвітньо відомого виробника та постачальника засобів захисту рослин &mdash; Makhteshim Agan Industries Ltd. Компанія успадкувала від Makhteshim Agan орієнтований на аграрія підхід до розробки продукту, жорсткі стандарти охорони навколишнього середовища та контролю якості.&nbsp;ADAMA Agricultural Solutions Ltd. поєднує понад 60-річний досвід у виробництві продуктів для аграрного ринку з перевагами єдиного глобального бренду.&nbsp;Компанія посідає шосте місце у списку провідних агрохімічних корпорацій світу і є лідером у виробництві та постачанні непатентованих засобів захисту рослин.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>Компанія &laquo;Штефес&raquo;,</strong>&nbsp;до складу якої входять ТОВ &laquo;Штефес&raquo;, фірма-реєстрант, і ПП &laquo;Марго&raquo;, що реалізує засоби захисту рослин, представлена на аграрному ринку України з 1993 року. Наша продукція широко відома і популярна серед українських аграріїв. Наш асортимент дозволяє знайти індивідуальний підхід до кожного господарства, а значить, вирішити навіть найскладніші технологічні завдання при вирощуванні цукрового буряку та інших культур.&nbsp;Наше завдання полягає в тому, щоб надати можливість придбати якісну, надійну та доступну продукцію якомога більшій кількості господарств в Україні. Наша мета &mdash; повноцінний захист сільськогосподарських культур, значне підвищення врожайності, шляхом надання широкого вибору засобів захисту рослин найвищої якості та вичерпних консультаційних послуг.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>SeedEra,&nbsp;</strong>підприємство є однією з провідних компаній з впровадження сучасних агротехнологій в українське сільгоспвиробництво та входить до п&rsquo;ятірки лідерів на ринку дистрибуції зсобів захисту рослин сільгоспвиробникам.Сфера діяльності компанії&nbsp;-&nbsp;виробництво&nbsp;та дистрибуція засобів захисту рослин, насіння,&nbsp;добрив, вирощування, переробка та продаж сільськогосподарської продукції, надання&nbsp;агрохімічного і агрономічного сервісу.&nbsp;А також,ТМ SeedEra( з 2012року )- це якісне насіння європейської селекції від відомих постачальників з Європи , які відрізняються високою схожістю та адаптованість посівного матеріалу до наших кліматичних умов .</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>ВНІС</strong>.Діяльність інституту спрямована на&nbsp;створення та&nbsp;широкомасштабне впровадження нових сортів та&nbsp;гібридів важливих сільськогосподарських культур. Висока результативність базується на&nbsp;глибокому аналізі потреб рослинницької галузі і тенденцій ринку та&nbsp;високій наукоємності як&nbsp;селекційного процесу, так&nbsp;і процесу насінництва. Оперативне розмноження нових гібридів з&nbsp;високим адаптивним потенціалом здійснюється при&nbsp;безпосередньому контролі селекціонерів без&nbsp;залучення посередників, що&nbsp;забезпечує повне збереження властивостей гібридів та&nbsp;високу якість насіння.Безперервно ведеться наукова робота по&nbsp;створенню сортів та&nbsp;гібридів соняшнику, кукурудзи, цукрового та&nbsp;кормового буряку, ріпаку, пшениці, ячменю та&nbsp;інших культур.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>&laquo;Нові сад&raquo;</strong>&nbsp;- це місто в Сербії, де перебувати Інститут рільництва і овочівництва, створений в далекому 1938-го року, і по сьогоднішній день, успішно продовжує свою діяльність в області селекції рослин і проведенні різних сільськогосподарських ісследованій.Продукція інституту, що випускається під назвою &laquo;Нові Сад&raquo;, являє собою відомі в усьому світі своєю якістю, насіння посівних культур. Не перший рік, займаючи одну з лідируючих позицій в галузі селекції рослин, інститут радує аграріїв Європи і світу результатами передових розробок в області селекції рослин та інших сільського хозяйства.Помімо селекції Інститут розвивається в напрямку вирощування, виробництва власних сортів і гібридів рослин. Таким чином, надаючи споживачам не тільки готові насіння, а й розроблені фахівцями Інституту програми по обробці грунту і рекомендації щодо дотримання технології вирощування. На сьогоднішній день Інститутом створено понад 950-ти сортів і гібридів рослин. Продукція &laquo;Нови Сад&raquo; представлена&nbsp;​​на&nbsp;ринках&nbsp;26-ти&nbsp;країн&nbsp;світу,&nbsp;укладено&nbsp;безліч&nbsp;міжнародних&nbsp;контрактів&nbsp;з&nbsp;іноземними&nbsp;представниками.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>ТОВ &laquo;Семагро&raquo;</strong>є вітчизняним виробником оригінального, елітного та репродукційного насіння сільськогосподарських культур. Працює на ринку насіння з 2001 року, є членами Ассоціації&nbsp; &laquo;Українське насіннєве товариство&raquo;, Громадської спілки &laquo;Асоціація &laquo;Селекції та насінництва соняшнику&raquo;. Семагро забезпечує українських виробників високоякісним сертифікованим насінням сучасних продуктивних, адаптованих&nbsp; гібридів соняшнику , кукурудзи, сортів сої, зернових, бобових та інших с/х культур, вирощеним&nbsp; з&nbsp; дотриманням технологій вирощування та правил ведення насінництва. Семагро&nbsp;займається вирощуванням на базі господарств, розташованих в Харківській, Київській, Полтавській, Одеській, Кіровоградській, Сумській областях та проходить доробку на власному насіннєвому заводі, оснащеним&nbsp; обладнанням&nbsp; виробництва &nbsp;HDTHaus&nbsp;Der&nbsp;Technik<strong>,&nbsp;&nbsp;</strong>із застосуванням кращих препаратів для захисту від хвороб, шкідників, стимуляторами росту, &nbsp;мікро- та макроелементами. З 2001 року Семагро плідно співпрацює з науковцями ІР ім. В.Я. Юр`єва НААН, м. Харків по впровадженню в виробництво кращих досягнень в селекції соняшнику, кукурудзи, сої, озимої та ярої пшениці, тритікале, ячменю. Продовжує співпраця з Всеукраїнським науковим інститутом селекції (ВНІС), іншими науковими закладами та вченими &ndash; селекціонерами. Кожного року ТОВ &laquo;Семагро&raquo; забезпечує надходження до українських аграріїв високоякісного насіння кращих сортів та гібридів соняшнику, насіння супереліти та еліти зернових культур та сої. Високий потенціал, закладений насінні &nbsp;дозволяє навіть&nbsp; в роки з важкими погодно-кліматичними умовами отримати не просто гідні, а дійсно високі врожаї.&nbsp;</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>Евраліс Семенс</strong>&nbsp;&mdash; один з лідерів серед насінницьких компаній Європи. Потужні інвестиції у наукові дослідження та сучасні насінницькі технології забеспечують високу якість насіння соняшника, кукурудзи, ріпаку, сорго та сої, яке пропонує компанія.&nbsp;Евраліс Семенс входить до французької агропромислової групи Євраліс, що була заснована на південному&nbsp;заході Франції у 1936 році.Започатковане у 1950 році виробництво насіння стало одним із стратегічних напрямків групи Євраліс.Кожного року 350 000 фермерів сіють більше 3 млн. гектарів продуктів генетики Євраліс Семенс.&nbsp;Дослідницька діяльність, яку впроваджує Євраліс Семенс,є однією з найбільш інтенсивних у Європі &ndash; на власні наукові дослідження компанія щороку витрачає понад 13% обігових коштів.&nbsp;На території Європи компанія має 10 дослідних центрів та понад 250 тисяч дослідно-демонстраційних полів. Потужні дослідження також проводяться у Північній та Південній Америці (США, Аргентина, Чилі тощо).&nbsp;Стратегія діяльності Євраліс Семенс чітко орієнтована на задоволення потреб клієнтів. Завдяки цій стратегії компанія перетнула 20%-ву долю на європейському ринку соняшника та займає провідні позиції на ринку кукурудзи та ріпаку, що демонструє корпоративний девіз &quot;Вирощуємо Вашу довіру&quot;.&nbsp;</p>\r\n\r\n<p style=\"margin-left:6.6pt\">Міжнародна компанія&nbsp;<strong>ТОВ &quot;ТерраТарса Україна&quot;</strong>&nbsp;була утворена восени 2011 року в результаті злиття компанії Doktor Tarsa (Туреччина) і групи компаній Терра. Спільне турецько-чилійське підприємство Доктор Тарса - DRT (50% акцій належить світовому лідеру з виробництва спеціальних добрив компанії SQM), виробляє з власної сировини широкий спектр спеціальних добрив на найсучаснішому і найбільшому в Європі заводі. На додаток до більш ніж 20 різних відамкомплексних NPK добрив, компанія виробляє спеціальні мікродобрива, розроблені за останнім словом агрохімічної науки. DRT є лідируючою компанією на ринку Туреччини, і поставляє свої добрива в більш ніж 30 різних країн. Група компаній Терра є піонером у сфері впровадження сучасних технологій крапельного зрошення та спеціальних добрив в овочівництві відкритого грунту в країнах СНД. Починаючи з 1999 року бренд Терра відомий як постачальник тільки найякісніших систем крапельного зрошення від Т-Таре і кращих комплексних удобреній.Компанія ТерраТарса має власні представництва в Україні та Росії, а також розгалужену дилерську мережу практично у всіх країнах СНД. Об&#39;єднання двох професійних команд, широкої дистрибуційної мережі та власне виробництво робить ТерраТарса незаперечним лідером на ринку України і країн СНД.</p>\r\n",
            "partners_text_ru" => "<p><strong>Сингента</strong>&mdash; это одна из ведущих компаний мира, в которой работает более 27 000 специалистов в более чем 90 странах мира для достижения одной цели: раскрыть потенциал растений. Благодаря передовым научным знанием, глобальным исследованиям и обязательствам перед своими клиентами, компания помогает увеличивать урожайность сельскохозяйственных &nbsp; &nbsp; культур, защищать окружающую среду &nbsp; и улучшать здоровье и качество жизни.</p>\r\n\r\n<p><strong>Компания &quot;Нертус&quot;</strong>основана в 2002 году и уже 10 лет плодотворно работает на агрохимическому рынке Украины.&nbsp;Ассортимент фирменных препаратов НЕРТУС&reg; состоит из около 50 зарегистрированных пестицидов и микроудобрений, полностью удовлетворяющих потребностям аграриев при выращивании и хранении зерновых культур, кукурузы, подсолнечника, рапса, сои, сахарной свеклы, плодовых культур и виноградников. Все средства защиты растений произведены по европейским стандартам качества и характеризуются высоким уровнем экологической и токсикологической безопасности</p>\r\n\r\n<p><strong>Компания Дюпон</strong>&nbsp;использует научные достижения в целях создания продуктов, которые помогают людям вести здоровый образ жизни, улучшить его качество и сделать жизнь людей во всем мире более безопасным. Компания Дюпон, которая создана в США в 1802 году, является одной из крупнейших в мире научных и индустриальных транснациональных корпораций. Она занимает ведущее положение в производстве материалов с высокими эксплуатационными характеристиками, химикатов специального назначения и других наукоемких направлениях.</p>\r\n\r\n<p><strong>Bayer&nbsp;</strong>&ndash; международный концерн со специализацией в области здравоохранения, сельского хозяйства и высокотехнологичных материалов. Как инновационная компания, Bayer задает тенденции развития наукоемких областей. Продукты и услуги компании направлены на благо людей и улучшение качества жизни. Коммерческая деятельность группы построена на основе внедрения инноваций, экономического роста и высокой доходности.&nbsp;Bayer придерживается принципов устойчивого развития и выступает в качестве социально и этически ответственной компании. В 2012 финансовом году численность сотрудников концерна составила 110 500 человек, объем продаж - 39800000000 евро. Капитальные затраты составили 2 млрд евро, расходы на исследования и разработки - 3 млрд евро.</p>\r\n\r\n<p>Представительство&nbsp;<strong>BASF SE</strong>&nbsp;в Украине было открыто в 1992 году в Киеве и стало одной из первых миссий крупных западных концернов в нашей стране. На текущий момент наши региональные представители работают во всех регионах страны. Отдел защиты растений обслуживает также клиентов в Молдове и на Кавказе. Бизнес BASF в Украине выходит за предел страны. Пластики, дисперсии и пигменты поставляются на рынок Республики Беларусь.&nbsp;С 2007 года вся деятельность BASF SE в Украине ведется через БАСФ ООО (Общество с Ограниченной Ответственностью). Количество сотрудников, работающих в Украине в настоящее время составляет 120 человек.</p>\r\n\r\n<p><strong>Компания ООО &laquo;САММИТ-АГРО ЮКРЕЙН&raquo;</strong>была основана в 1999 году японской корпорацией СУМИТОМОКОРПОРЕЙШН.&nbsp;История группы СУМИТОМО уходит своими корнями в начало XVII века, когда Масатомо Сумитомо и Риемон Сога объединились в общем деле - добычи и плавники меди. Позже было освоено целый ряд других областей деятельности, включая финансы, страхование, чугунную и сталеплавильную промышленность и недвижимость. На сегодня группа Сумитомо является одной из крупнейших комплексных групп Японии.&nbsp;Компания СУМИТОМО КОРПОРЕЙШН была основана в 1919г. и на сегодняшний день входит в пятерку крупнейших транснациональных корпораций мира (корпорация представлена​​в 67 странах мира и имеет более 72 000 сотрудников). Основные направления бизнеса корпорации: металлургия, транспорт и строительство, инфраструктура и коммуникации, энергетика и химия, потребительские товары и тому подобное. Агрохимический направление бизнеса корпорации активно развивается начиная с 1962г.</p>\r\n\r\n<p style=\"margin-left:6.6pt\">&nbsp;</p>\r\n\r\n<p><strong>&quot;Дюпон Пионер&quot;&nbsp;</strong>является мировым лидером в разработке и предоставлении современной генетики растений и предлагает семена высокого качества фермерам в более чем 90 странах мира.&nbsp;Компания &laquo;Пионер&raquo; предоставляет агрономическое поддержку и сопровождение с целью повышения производительности и прибыльности аграриев, а также стремится развивать системы устойчивого ведения сельского хозяйства во всем мире.&nbsp;Растущее население, изменения в экономике и ограниченность пахотных земель являются самыми факторами, побуждающими &quot;Пионер&quot; активно использовать достижения науки в растениеводстве для повышения эффективности отдачи с каждого гектара земли..</p>\r\n\r\n<p style=\"margin-left:6.6pt\">Международная компания&nbsp;<strong>ООО &quot;ТерраТарса Украины&quot;</strong>&nbsp;была создана осенью 2011 года в результате слияния компании Doktor Tarsa (Турция) и группы компаний Терра. Основным видом деятельности компании является поставка комплексных технологических решений для выращивания овощей в закрытом и открытом грунте, а также производство специальных микроудобрений для внекорневой подкормки полевых культур.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>Компания Yara</strong>&nbsp;берет свое начало с норвежской промышленной фирмы Norsk Hydro (Норск Гидро), которая была основана в 1905 году. А именно, когда промышленники Сэм Эйде, Кристиан Биркеланд и Маркус Валленберг обратились к самому гидроресурса Норвегии с целью производства первых продуктов компании: минерального удобрения, которое привлекает внимание во всем мире, поскольку позволяло фермерам повышать урожайность их культур.&nbsp;Десятилетия спустя, после того, как Norsk Hydro расширила спектр своей деятельности от удобрений до нефти и металлов, подразделение, посвященный сельскохозяйственной и побочной продукции, был выделен как отдельный. Yara International ASA дебютировала на фондовой бирже в Осло в 2004 году, но многое произошло за прошедшие годы и история компании продолжается ...</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>ADAMA Agricultural Solutions Ltd.</strong>&nbsp;(прежнее название -MakhteshimAgan Industries Ltd.) - мировой лидер по производству и поставкам брендовых постпатентних средств защиты растений и других продуктов химической промышленности.&nbsp;Компания предоставляет простые решения для всей ряда сельскохозяйственных процессов с помощью уникальных продуктов и комбинаций действующих веществ.&nbsp;ADAMA Agricultural Solutions Ltd. - Международная компания с глубокими историческими истоками, преемник всемирно известного производителя и поставщика средств защиты растений - Makhteshim Agan Industries Ltd. Компания унаследовала от Makhteshim Agan ориентирован на агрария подход к разработке продукта, жесткие стандарты охраны окружающей среды и контроля качества.&nbsp;ADAMA Agricultural Solutions Ltd. объединяет более 60-летний опыт в производстве продуктов для аграрного рынка с преимуществами единого глобального бренда.&nbsp;Компания занимает шестое месте в списке ведущих агрохимических компаний мира и является лидером в производстве и поставке непатентованных средств защиты растений.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>Компания &laquo;Штефес&raquo;</strong>, в состав которой входят ООО &laquo;Штефес&raquo;, фирма-регистрант, и ООО &laquo;Марго&raquo;, реализующая средства защиты растений, представленная на аграрном рынке Украины с 1993 года. Наша продукция широко известна и популярна среди украинских аграриев. Наш ассортимент позволяет найти индивидуальный подход к каждому хозяйства, а значит, решить даже самые сложные технологические задачи при выращивании сахарной свеклы и других культур.&nbsp;Наша задача состоит в том, чтобы предоставить возможность приобрести качественную, надежную и доступную продукцию как можно большему количеству хозяйств в Украине. Наша цель - полноценная защита сельскохозяйственных культур, значительное повышение урожайности путем предоставления широкого выбора средств защиты растений высочайшего качества и исчерпывающих консультационных услуг.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>SeedEra,</strong>&nbsp;предприятие является одной из ведущих компаний по внедрению современных агротехнологий в украинское сельхозпроизводство и входит в пятерку лидеров на рынке дистрибуции с собой защиты растений сильгоспвиробникам.Сфера деятельности компании - производство и дистрибуция средств защиты растений, семян, удобрений, выращивание, переработка и продажа сельскохозяйственной продукции, предоставление агрохимического и агрономического сервиса. А также, ТМ SeedEra (с 2012 года) - это качественные семена европейской селекции от известных поставщиков из Европы, которые отличаются высокой всхожестью и адаптированность посевного материала к нашим климатическим условиям.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>ВНИС</strong>.Деятельность института направлена&nbsp;​​на&nbsp;создание&nbsp;и&nbsp;широкомасштабное&nbsp;внедрение&nbsp;новых&nbsp;сортов&nbsp;и&nbsp;гибридов&nbsp;важных&nbsp;сельскохозяйственных&nbsp;культур.&nbsp;Высокаярезультативность&nbsp;базируется&nbsp;на&nbsp;глубоком&nbsp;анализе&nbsp;потребностей&nbsp;растениеводческой&nbsp;отрасли&nbsp;и&nbsp;тенденций&nbsp;рынка&nbsp;и&nbsp;высокой наукоемкости как селекционного процесса, так и процесса семеноводства. Оперативное размножения новых гибридов с высоким адаптивным потенциалом осуществляется при непосредственном контроле селекционеров без привлечения посредников, обеспечивает полную сохранность свойств гибридов и высокое качество семян.Непрерывно ведется научная работа по созданию сортов и гибридов подсолнечника, кукурузы, сахарной и кормовой свеклы, рапса, пшеницы, ячменя и других культур.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>&laquo;</strong><strong>Нови сад</strong>&raquo;&nbsp;&mdash; это город в Сербии, где&nbsp;находиться Инс<strong>титут полеводства и овощеводства,</strong>созданный в далеком 1938-ом году, и по сегодняшний день,успешно продолжающий свою деятельность в области селекции растений и проведении различных сельскохозяйственных исследований.П<strong>родукция института</strong><strong>,&nbsp;</strong>выпускаемая под названием<strong>&laquo;Нови Сад&raquo;,</strong>представляет собой известные во всем мире своим качеством,<strong><a href=\"http://b-t.in.ua/semena/\">семена</a></strong><strong>посевных культур</strong>. Не первый год, занимая одну из лидирующих позиций в области селекции растений, институт радует аграриев Европы и мира результатами передовых разработок в области селекции растений и других сельского хозяйства.Помимо селекции Институт развивается в направлении выращивания, производства собственных сортов и гибридов растений. Таким образом, предоставляя потребителям не только готовые семена, но и разработанные специалистами Института программы по обработке почвы и рекомендации по соблюдению технологии выращивания. На сегодняшний день Институтом создано более 950-ти сортов и гибридов растений.&nbsp;<strong>Продукция &laquo;Нови Сад&raquo;</strong>&nbsp;представлена на рынках 26-ти стран мира, заключено множество международных контрактов с иностранными представителями.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>ООО &laquo;Семагро&raquo;</strong>&nbsp;является отечественным производителем оригинальных, элитных и репродукционных семян сельскохозяйственных культур. Работает на рынке семян с 2001 года, члены Ассоциации &laquo;Украинский семенное общество&raquo;, Общественного союза &laquo;Ассоциация&laquo; селекции и семеноводства подсолнечника &raquo;. Семагро обеспечивает украинских производителей высококачественным сертифицированным семенами современных производительных, адаптированных гибридов подсолнечника, кукурузы, сортов сои, зерновых, бобовых и других с / х культур, выращенным с соблюдением технологий выращивания и правил ведения семеноводства. Семагро занимается выращиванием на базе хозяйств, расположенных в Харьковской, Киевской, Полтавской, Одесской, Кировоградской, Сумской областях и проходит доработку на собственном семенном заводе, оснащенным оборудованием производства HDTHaus Der Technik, с применением лучших препаратов для защиты от болезней, вредителей, стимуляторами роста, микро- и макроэлементами. С 2001 года Семагро плодотворно сотрудничает с учеными ИР им. В.Я. Юрьева НААН, г.. Харьков по внедрению в производство лучших достижений в селекции подсолнечника, кукурузы, сои, озимой и яровой пшеницы, тритикале, ячменя. Продолжает сотрудничество с Всеукраинским научным институтом селекции (ВНИС), другими научными учреждениями и учеными - селекционерами. Ежегодно ООО &laquo;Семагро&raquo; обеспечивает поступление в украинских аграриев высококачественных семян лучших сортов и гибридов подсолнечника, семена суперэлиты и элиты зерновых культур и сои. Высокий потенциал, заложенный семенах позволяет даже в годы с тяжелыми погодно-климатическими условиями получить не просто достойные, а действительно высокие урожаи.</p>\r\n\r\n<p style=\"margin-left:6.6pt\"><strong>ЕВРАЛИС Семенс</strong>&nbsp;- один из лидеров среди семеноводческих компаний Европы. Мощные инвестиции в научные исследования и современные семенные технологии обеспечивают высокое качество семян подсолнечника, кукурузы, рапса, сорго и сои, которое предлагает компания. ЕВРАЛИС Семенс входит во французскую агропромышленной группы Евралис, основанная на юго-западе Франции в 1936 году. Созданный в 1950 году производство семян стало одним из стратегических направлений группы Евралис. Ежегодно 350 000 фермеров сеют более 3 млн. Гектаров продуктов генетики Евралис Семенс. Исследовательская деятельность, которую проводит Евралис Семенс, является одной из самых интенсивных в Европе - на собственные научные исследования компания ежегодно тратит более 13% оборотных средств. На территории Европы компания имеет 10 исследовательских центров и более 250 000 опытно-демонстрационных полей. Мощные исследования также проводятся в Северной и Южной Америке (США, Аргентина, Чили и т.д.). Стратегия деятельности Евралис Семенс четко ориентирована на удовлетворение потребностей клиентов. Благодаря этой стратегии компания пересекла 20% -ную долю на европейском рынке подсолнечника и занимает ведущие позиции на рынке кукурузы и рапса, что демонстрирует корпоративный девиз &quot;Выращиваем Ваше доверие&quot;.</p>\r\n\r\n<p style=\"margin-left:6.6pt\">Международная компания&nbsp;<strong>ООО &quot;ТерраТарса Украина&quot;</strong>&nbsp;была образована осенью 2011 года в результате слияния компании&nbsp;<a href=\"http://www.doktortarsa.com/\">Doktor Tarsa</a>&nbsp;(Турция) и группы компаний Терра.&nbsp;Совместное турецко-чилийское предприятие&nbsp; Доктор Тарса -&nbsp;DRT&nbsp;(50% акций принадлежит мировому лидеру по производству специальных удобрений компании&nbsp;SQM),&nbsp;производит из собственного сырья&nbsp;широкий спектр специальных удобрений&nbsp; на&nbsp; самом современном и&nbsp;крупнейшем в Европе заводе.&nbsp; В дополнение к&nbsp;&nbsp;более&nbsp;чем 20 различным видамкомплексных NPK удобрений, компания производит специальные микроудобрения, разработанные по последнему слову агрохимической науки.&nbsp;DRT&nbsp;является лидирующей компанией на рынке Турции,&nbsp;&nbsp;и поставляет свои удобрения в более чем 30 различных стран.&nbsp;Группа компаний Терра &nbsp;является пионером в сфере внедрения современных технологий капельного орошения и специальных удобрений в овощеводстве открытого грунта в странах СНГ. Начиная с 1999 года&nbsp; бренд Терра&nbsp; известен как поставщик только самых качественных систем капельного орошения от&nbsp;<a href=\"http://terratarsa.com/ru/kapelnaja_lenta_t_tare\" target=\"_blank\">Т-Таре</a>&nbsp;&nbsp;и&nbsp;<a href=\"http://terratarsa.com/ru/udobrenija\" target=\"_blank\">лучших комплексных удобрений</a>.Компания ТерраТарса &nbsp;имеет собственные представительства в Украине и России,&nbsp; а также разветвленную дилерскую сеть практически во всех странах СНГ.&nbsp; Объединение двух профессиональных команд, широкой дистрибуционной сети&nbsp; и собственное производство делает&nbsp; ТерраТарса непререкаемым лидером на рынке Украины и стран СНГ.</p>\r\n",
            "contacts_phone" => "<span>+38 (048)</span>  736 91 49",
            "contacts_cell_phone" => "<span>+38 (096)</span> 733 73 30",
            "contacts_cell_phone_2" => " <span>+38 (099)</span> 733 73 30",
            "contacts_email" => "hectare.ua@gmail.com",
            "contacts_skype" => "hectare.ua",
            "contacts_address" => "Николаев, ул.Адмиральская 15",
            "contacts_address_uk" => "Миколаїв, вул. Адміральська 15",
            "front_video_url" => "https://www.youtube.com/embed/6wIMiCJXVfs",
            "google_play_link" => "https://play.google.com/store/apps/details?id=ua.com.hectare",
            "app_store_link" => "https://itunes.apple.com/app/korporacia-gektar/id1147659441",
            "map_url" => "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d2722.2372465742237!2d31.986415615608767!3d46.97667457914791!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x40c5c976ad879df7%3A0x50cc027487843918!2z0LLRg9C70LjRhtGPINCQ0LTQvNGW0YDQsNC70YzRgdGM0LrQsCwgMTUsINCc0LjQutC-0LvQsNGX0LIsINCc0LjQutC-0LvQsNGX0LLRgdGM0LrQsCDQvtCx0LvQsNGB0YLRjA!5e0!3m2!1suk!2sua!4v1473341581145",
            "yt_link" => "",
            "gp_link" => "https://plus.google.com/u/5/115495484453326381973",
            "vk_link" => "https://vk.com/hectare_com_ua",
            "fb_link" => "https://www.facebook.com/hectare.com.ua/",
            "ok_link" => "",
        ];
    }

    private function _countries()
    {
        return [
            ['Afghanistan', 'AFG', 'AF'],
            ['Albania', 'ALB', 'AL'],
            ['Algeria', 'DZA', 'DZ'],
            ['American Samoa', 'ASM', 'AS'],
            ['Andorra', 'AND', 'AD'],
            ['Angola', 'AGO', 'AO'],
            ['Anguilla', 'AIA', 'AI'],
            ['Antarctica', 'ATA', 'AQ'],
            ['Antigua and Barbuda', 'ATG', 'AG'],
            ['Argentina', 'ARG', 'AR'],
            ['Armenia', 'ARM', 'AM'],
            ['Aruba', 'ABW', 'AW'],
            ['Australia', 'AUS', 'AU'],
            ['Austria', 'AUT', 'AT'],
            ['Azerbaijan', 'AZE', 'AZ'],
            ['Bahamas', 'BHS', 'BS'],
            ['Bahrain', 'BHR', 'BH'],
            ['Bangladesh', 'BGD', 'BD'],
            ['Barbados', 'BRB', 'BB'],
            ['Belarus', 'BLR', 'BY'],
            ['Belgium', 'BEL', 'BE'],
            ['Belize', 'BLZ', 'BZ'],
            ['Benin', 'BEN', 'BJ'],
            ['Bermuda', 'BMU', 'BM'],
            ['Bhutan', 'BTN', 'BT'],
            ['Bolivia', 'BOL', 'BO'],
            ['Bosnia and Herzegowina', 'BIH', 'BA'],
            ['Botswana', 'BWA', 'BW'],
            ['Bouvet Island', 'BVT', 'BV'],
            ['Brazil', 'BRA', 'BR'],
            ['British Indian Ocean Territory', 'IOT', 'IO'],
            ['Brunei Darussalam', 'BRN', 'BN'],
            ['Bulgaria', 'BGR', 'BG'],
            ['Burkina Faso', 'BFA', 'BF'],
            ['Burundi', 'BDI', 'BI'],
            ['Cambodia', 'KHM', 'KH'],
            ['Cameroon', 'CMR', 'CM'],
            ['Canada', 'CAN', 'CA'],
            ['Cape Verde', 'CPV', 'CV'],
            ['Cayman Islands', 'CYM', 'KY'],
            ['Central African Republic', 'CAF', 'CF'],
            ['Chad', 'TCD', 'TD'],
            ['Chile', 'CHL', 'CL'],
            ['China', 'CHN', 'CN'],
            ['Christmas Island', 'CXR', 'CX'],
            ['Cocos (Keeling) Islands', 'CCK', 'CC'],
            ['Colombia', 'COL', 'CO'],
            ['Comoros', 'COM', 'KM'],
            ['Congo', 'COG', 'CG'],
            ['Cook Islands', 'COK', 'CK'],
            ['Costa Rica', 'CRI', 'CR'],
            ['Cote D\'Ivoire', 'CIV', 'CI'],
            ['Croatia', 'HRV', 'HR'],
            ['Cuba', 'CUB', 'CU'],
            ['Cyprus', 'CYP', 'CY'],
            ['Czech Republic', 'CZE', 'CZ'],
            ['Denmark', 'DNK', 'DK'],
            ['Djibouti', 'DJI', 'DJ'],
            ['Dominica', 'DMA', 'DM'],
            ['Dominican Republic', 'DOM', 'DO'],
            ['East Timor', 'TMP', 'TL'],
            ['Ecuador', 'ECU', 'EC'],
            ['Egypt', 'EGY', 'EG'],
            ['El Salvador', 'SLV', 'SV'],
            ['Equatorial Guinea', 'GNQ', 'GQ'],
            ['Eritrea', 'ERI', 'ER'],
            ['Estonia', 'EST', 'EE'],
            ['Ethiopia', 'ETH', 'ET'],
            ['Falkland Islands (Malvinas)', 'FLK', 'FK'],
            ['Faroe Islands', 'FRO', 'FO'],
            ['Fiji', 'FJI', 'FJ'],
            ['Finland', 'FIN', 'FI'],
            ['France', 'FRA', 'FR'],
            ['France Metropolitan', 'FXX', 'FX'],
            ['French Guiana', 'GUF', 'GF'],
            ['French Polynesia', 'PYF', 'PF'],
            ['French Southern Territories', 'ATF', 'TF'],
            ['Gabon', 'GAB', 'GA'],
            ['Gambia', 'GMB', 'GM'],
            ['Georgia', 'GEO', 'GE'],
            ['Germany', 'DEU', 'DE'],
            ['Ghana', 'GHA', 'GH'],
            ['Gibraltar', 'GIB', 'GI'],
            ['Greece', 'GRC', 'GR'],
            ['Greenland', 'GRL', 'GL'],
            ['Grenada', 'GRD', 'GD'],
            ['Guadeloupe', 'GLP', 'GP'],
            ['Guam', 'GUM', 'GU'],
            ['Guatemala', 'GTM', 'GT'],
            ['Guinea', 'GIN', 'GN'],
            ['Guinea-bissau', 'GNB', 'GW'],
            ['Guyana', 'GUY', 'GY'],
            ['Haiti', 'HTI', 'HT'],
            ['Heard and Mc Donald Islands', 'HMD', 'HM'],
            ['Honduras', 'HND', 'HN'],
            ['Hong Kong', 'HKG', 'HK'],
            ['Hungary', 'HUN', 'HU'],
            ['Iceland', 'ISL', 'IS'],
            ['India', 'IND', 'IN'],
            ['Indonesia', 'IDN', 'ID'],
            ['Iran (Islamic Republic of)', 'IRN', 'IR'],
            ['Iraq', 'IRQ', 'IQ'],
            ['Ireland', 'IRL', 'IE'],
            ['Israel', 'ISR', 'IL'],
            ['Italy', 'ITA', 'IT'],
            ['Jamaica', 'JAM', 'JM'],
            ['Japan', 'JPN', 'JP'],
            ['Jordan', 'JOR', 'JO'],
            ['Kazakhstan', 'KAZ', 'KZ'],
            ['Kenya', 'KEN', 'KE'],
            ['Kiribati', 'KIR', 'KI'],
            ['Korea Democratic People\'s Republic of', 'PRK', 'KP'],
            ['Korea Republic of', 'KOR', 'KR'],
            ['Kuwait', 'KWT', 'KW'],
            ['Kyrgyzstan', 'KGZ', 'KG'],
            ['Lao People\'s Democratic Republic', 'LAO', 'LA'],
            ['Latvia', 'LVA', 'LV'],
            ['Lebanon', 'LBN', 'LB'],
            ['Lesotho', 'LSO', 'LS'],
            ['Liberia', 'LBR', 'LR'],
            ['Libyan Arab Jamahiriya', 'LBY', 'LY'],
            ['Liechtenstein', 'LIE', 'LI'],
            ['Lithuania', 'LTU', 'LT'],
            ['Luxembourg', 'LUX', 'LU'],
            ['Macau', 'MAC', 'MO'],
            ['Macedonia The Former Yugoslav Republic of', 'MKD', 'MK'],
            ['Madagascar', 'MDG', 'MG'],
            ['Malawi', 'MWI', 'MW'],
            ['Malaysia', 'MYS', 'MY'],
            ['Maldives', 'MDV', 'MV'],
            ['Mali', 'MLI', 'ML'],
            ['Malta', 'MLT', 'MT'],
            ['Marshall Islands', 'MHL', 'MH'],
            ['Martinique', 'MTQ', 'MQ'],
            ['Mauritania', 'MRT', 'MR'],
            ['Mauritius', 'MUS', 'MU'],
            ['Mayotte', 'MYT', 'YT'],
            ['Mexico', 'MEX', 'MX'],
            ['Micronesia Federated States of', 'FSM', 'FM'],
            ['Moldova Republic of', 'MDA', 'MD'],
            ['Monaco', 'MCO', 'MC'],
            ['Mongolia', 'MNG', 'MN'],
            ['Montserrat', 'MSR', 'MS'],
            ['Morocco', 'MAR', 'MA'],
            ['Mozambique', 'MOZ', 'MZ'],
            ['Myanmar', 'MMR', 'MM'],
            ['Namibia', 'NAM', 'NA'],
            ['Nauru', 'NRU', 'NR'],
            ['Nepal', 'NPL', 'NP'],
            ['Netherlands', 'NLD', 'NL'],
            ['Netherlands Antilles', 'ANT', 'AN'],
            ['New Caledonia', 'NCL', 'NC'],
            ['New Zealand', 'NZL', 'NZ'],
            ['Nicaragua', 'NIC', 'NI'],
            ['Niger', 'NER', 'NE'],
            ['Nigeria', 'NGA', 'NG'],
            ['Niue', 'NIU', 'NU'],
            ['Norfolk Island', 'NFK', 'NF'],
            ['Northern Mariana Islands', 'MNP', 'MP'],
            ['Norway', 'NOR', 'NO'],
            ['Oman', 'OMN', 'OM'],
            ['Pakistan', 'PAK', 'PK'],
            ['Palau', 'PLW', 'PW'],
            ['Panama', 'PAN', 'PA'],
            ['Papua New Guinea', 'PNG', 'PG'],
            ['Paraguay', 'PRY', 'PY'],
            ['Peru', 'PER', 'PE'],
            ['Philippines', 'PHL', 'PH'],
            ['Pitcairn', 'PCN', 'PN'],
            ['Poland', 'POL', 'PL'],
            ['Portugal', 'PRT', 'PT'],
            ['Puerto Rico', 'PRI', 'PR'],
            ['Qatar', 'QAT', 'QA'],
            ['Reunion', 'REU', 'RE'],
            ['Romania', 'ROM', 'RO'],
            ['Russian Federation', 'RUS', 'RU'],
            ['Rwanda', 'RWA', 'RW'],
            ['Saint Kitts and Nevis', 'KNA', 'KN'],
            ['Saint Lucia', 'LCA', 'LC'],
            ['Saint Vincent and the Grenadines', 'VCT', 'VC'],
            ['Samoa', 'WSM', 'WS'],
            ['San Marino', 'SMR', 'SM'],
            ['Sao Tome and Principe', 'STP', 'ST'],
            ['Saudi Arabia', 'SAU', 'SA'],
            ['Senegal', 'SEN', 'SN'],
            ['Seychelles', 'SYC', 'SC'],
            ['Sierra Leone', 'SLE', 'SL'],
            ['Singapore', 'SGP', 'SG'],
            ['Slovakia (Slovak Republic)', 'SVK', 'SK'],
            ['Slovenia', 'SVN', 'SI'],
            ['Solomon Islands', 'SLB', 'SB'],
            ['Somalia', 'SOM', 'SO'],
            ['South Africa', 'ZAF', 'ZA'],
            ['South Georgia and the South Sandwich Islands', 'SGS', 'GS'],
            ['Spain', 'ESP', 'ES'],
            ['Sri Lanka', 'LKA', 'LK'],
            ['St. Helena', 'SHN', 'SH'],
            ['St. Pierre and Miquelon', 'SPM', 'PM'],
            ['Sudan', 'SDN', 'SD'],
            ['Suriname', 'SUR', 'SR'],
            ['Svalbard and Jan Mayen Islands', 'SJM', 'SJ'],
            ['Swaziland', 'SWZ', 'SZ'],
            ['Sweden', 'SWE', 'SE'],
            ['Switzerland', 'CHE', 'CH'],
            ['Syrian Arab Republic', 'SYR', 'SY'],
            ['Taiwan', 'TWN', 'TW'],
            ['Tajikistan', 'TJK', 'TJ'],
            ['Tanzania United Republic of', 'TZA', 'TZ'],
            ['Thailand', 'THA', 'TH'],
            ['Togo', 'TGO', 'TG'],
            ['Tokelau', 'TKL', 'TK'],
            ['Tonga', 'TON', 'TO'],
            ['Trinidad and Tobago', 'TTO', 'TT'],
            ['Tunisia', 'TUN', 'TN'],
            ['Turkey', 'TUR', 'TR'],
            ['Turkmenistan', 'TKM', 'TM'],
            ['Turks and Caicos Islands', 'TCA', 'TC'],
            ['Tuvalu', 'TUV', 'TV'],
            ['Uganda', 'UGA', 'UG'],
            ['Ukraine', 'UKR', 'UA'],
            ['United Arab Emirates', 'ARE', 'AE'],
            ['United Kingdom', 'GBR', 'GB'],
            ['United States', 'USA', 'US'],
            ['United States Minor Outlying Islands', 'UMI', 'UM'],
            ['Uruguay', 'URY', 'UY'],
            ['Uzbekistan', 'UZB', 'UZ'],
            ['Vanuatu', 'VUT', 'VU'],
            ['Vatican City State (Holy See)', 'VAT', 'VA'],
            ['Venezuela', 'VEN', 'VE'],
            ['Viet Nam', 'VNM', 'VN'],
            ['Virgin Islands (British)', 'VGB', 'VG'],
            ['Virgin Islands (U.S)', 'VIR', 'VI'],
            ['Wallis and Futuna Islands', 'WLF', 'WF'],
            ['Western Sahara', 'ESH', 'EH'],
            ['Yemen', 'YEM', 'YE'],
            ['Yugoslavia', 'YUG', 'YU'],
            ['Zaire', 'ZAR', 'ZR'],
            ['Zambia', 'ZMB', 'ZM'],
            ['Zimbabwe', 'ZWE', 'ZW'],
        ];
    }
}
